{
  "npcName": "Juez Esqueletal",
  "quests": [
    255
  ],
  "dialogue": [
    {
      "id": "common_intro",
      "nodes": [
        {
          "id": 0,
          "text": "Hola Maki, bienvenido al último círculo del infierno. Desafortunadamente terminaste acá, pero podemos hacer un trato si te parece.",
          "options": [
            {
              "text": "¿Por qué el último círculo del infierno?",
              "_action": "goToNode",
              "value": 1
            },
            {
              "text": "Sí, de una a lo del trato",
              "_action": "goToNode",
              "value": 2
            }
          ]
        },
        {
          "id": 1,
          "text": "Porque fuiste muy malo, qué se yo. Yo no tomo estas decisiones. En los otros círculos hay cangrejos. En este no.",
          "options": [
            {
              "text": "¿Pero son importantes los cangrejos? no sé qué hacer con esa información",
              "_action": "goToNode",
              "value": 3
            },
            {
              "text": "Suficiente, contame del trato",
              "_action": "goToNode",
              "value": 2
            }
          ]
        },
        {
          "id": 2,
          "text": "El trato consiste en que ayudes a otros esqueletos a demostrar su profesión. Si lo hacés te puedo pasar a un infierno más copado, con cangrejos.",
          "options": [
            {
              "text": "¿Cómo hago?",
              "_action": "goToNode",
              "value": 6
            },
            {
              "text": "Uhh, contame sobre los cangrejos",
              "_action": "goToNode",
              "value": 3
            }
          ]
        },
        {
          "id": 3,
          "text": "O sea, los cangrejos son parte de la comida de muchos animales: Muchos otros animales comen cangrejos. Si no hubiera cangrejos, estos animales tendrían menos comida.",
          "options": [
            {
              "text": "Más información sobre cangrejos por favor",
              "_action": "goToNode",
              "value": 4
            }
          ]
        },
        {
          "id": 4,
          "text": "Los cangrejos también ayudan a limpiar el agua, construyen casas en la tierra y hacen agujeros en la arena. Esto crea hogares para otros animales pequeños. ",
          "options": [
            {
              "text": "MÁS INFORMACIÓN SOBRE CANGREJOS Y SU IMPORTANCIA",
              "_action": "goToNode",
              "value": 5
            }
          ]
        },
        {
          "id": 5,
          "text": "Por último nos pueden decir si el agua está limpia o sucia: Algunos cangrejos solo pueden vivir en agua limpia. Si encontramos muchos cangrejos en un lugar, significa que el agua está sana.",
          "options": [
            {
              "text": "Creo que ya tuve suficiente, ahora hablame del trato",
              "_action": "goToNode",
              "value": 7
            }
          ]
        },
        {
          "id": 6,
          "text": "Busca un esqueleto por la calle y hablale, seguramente te va a decir qué necesita y cómo lo podes ayudar",
          "options": [
            {
              "text": "Perfecto, gg",
              "_action": "endChat"
            }
          ]
        },
        {
          "id": 7,
          "text": "El trato consiste en que ayudes a otros esqueletos a demostrar su profesión. Si lo hacés te puedo pasar a un infierno más copado, con cangrejos.",
          "options": [
            {
              "text": "Basado en la información sobre cangrejos que obtuve, parece un buen trato",
              "_action": "goToNode",
              "value": 6
            },
            {
              "text": "Basado en la información sobre cangrejos que obtuve, no parece un buen trato.",
              "_action": "goToNode",
              "value": 6
            }
          ]
        }
      ]
    }
  ]
}